.include "m168Adef.inc"

.org 0x0000             ; точка входа
    rjmp main

main:
    ldi r16, 5          ; загружаем 5 в регистр r16
    ldi r17, 3          ; загружаем 3 в регистр r17
    add r16, r17        ; r16 = r16 + r17
    inc r16             ; r16++
    sub r16, r17        ; r16 = r16 - r17
    dec r16             ; r16--

    sts 0x0100, r16     ; сохраняем значение регистра r16 в оперативку по адресу 0x0100
    lds r18, 0x0100     ; загружаем значение из оперативки по адресу 0x0100

loop:
 rjmp loop